/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
*/

// error sheet
"One or more input fields are incorrect" = "Un ou plusieurs champs de saisie sont incorrects";
"is required" = "est requis";
"doesn't match the required format" = "ne correspond pas au format requis";

// required fields text
"* Required Fields" = "* Champs obligatoires";

//buttons
"Cancel" = "Annuler";
"More Information" = "Plus d'information";
"OK" = "D'accord";
"Select" = "Sélectionner";

//default text
"default-title" = "";
"default-message" = "";
"Click for additional information" = "Cliquez pour plus d'informations";

"Confirm" = "Confirmer";
"Downloading" = "Téléchargement";

"confirmation failed  <br>values do not match" = "échec de la confirmation <br>les valeurs ne correspondent pas";

//constructor kit labels
"Welcome to the swiftDialog builder"            = "Bienvenue dans le générateur de SwiftDialog";
"Select properties on the left to modify. swiftDialog will update to show the changes in realtime"        = "Sélectionnez les propriétés à gauche pour les modifier. SwiftDialog se mettra à jour pour afficher les modifications en temps réel";
"Basic"              = "Basique";
"Content"            = "Teneur";
"Window"             = "La fenêtre";
"Sidebar"            = "Barre latérale";
"Data Entry"          = "Saisie des données";
"Buttons"            = "Boutons";
"Advanced"           = "Avancé";
"List Items"          = "Liste des éléments";
"Images"             = "Images";
"Media"              = "Médias";
"Output"             = "Production";
"JSON Output"         = "Sortie JSON";
"Quit"              = "Quitter";
"Export Command"      = "Commande d'exportation";
"Title"              = "Titre";
"Colour"             = "Couleur";
"Reset"              = "Réinitialiser";
"Font Size: "           = "Taille de police: ";
"value:"              = "évaluer:";
"Message"           = "Message";
"Text Alignment"      = "Alignement du texte";
"Vertical Position"   = "Position verticale";
"Window Height"       = "Hauteur de la fenêtre";
"Height value:"        = "Valeur de hauteur :";
"Window Width"        = "Largeur de la fenêtre";
"Width value:"         = "Valeur de largeur :";
"Window Properties"   = "Propriétés de la fenêtre";
"Preset Sizes"        = "Tailles prédéfinies";
"Small"              = "Petit";
"Big"                = "Grand";
"Screen Background Blur"         = "Flou d'arrière-plan de l'écran";
"Movable"            = "Mobile";
"Force on Top"         = "Forcer au sommet";
"Progress Bar"        = "Barre de progression";
"Progress value:"      = "Valeur de progression :";
"Progress Text:"       = "Texte de progression :";
"Banner Image"        = "Image de bannière";
"Select"             = "Sélectionner";
"Watermark"          = "Filigrane";
"Fill"               = "Remplir";
"Opacity"              = "Alpha";
"Scale"              = "Échelle";
"Position"           = "Positionner";
"Icon"               = "Icône";
"Visible"            = "Visible";
"Centred"            = "Centré";
"Select"             = "Sélectionner";
"Icon Size"           = "Taille de l'icône";
"Size value:"          = "Valeur de taille :";
"Overlay"            = "Recouvrir";
"Infobox"            = "Boîte d'info";
"Infotext"           = "Texte d'information";
"Info Text"      = "Texte d'information";
"Button1"            = "Bouton1";
"Button2"            = "Bouton2";
"Info Button"    = "Bouton Infos";
"Quit on Info"         = "Quitter sur info";
"Label: "              = "Étiquette: ";
"Info Button Action: "   = "Action du bouton d'informations : ";
"AutoPlay"           = "Lecture automatique";
"Autoplay Seconds"    = "Lecture automatique des secondes";
"Path"               = "Chemin";
"Caption"            = "Légende";
"Status Text"         = "Texte d'état";
"Status"             = "Statut";
"Format output as JSON"         = "Formater la sortie en JSON";
"Textfields"         = "Champs de texte";
"Show"               = "Montrer";
"Required"           = "Obligatoire";
"Secure"             = "Sécurise";
"Prompt"             = "Rapide";
"Regex"              = "Regex";
"Regex Error"         = "Erreur d'expression régulière";
"Select"             = "Sélectionner";
"Checkbox"           = "Case à cocher";
"Video"              = "Vidéo";
"Filename"           = "Nom de fichier";
"Web"                = "La toile";
"URL"                = "URL";
"Disabled"           = "Désactivée";
"Enabled"            = "Autorisé";
